In [3]:
import pandas as pd
import sqlite3

name = 'Alejandra Camino'

conn = sqlite3.connect("normalized.db")
sql_statement = """ 
        SELECT
            CASE
                WHEN 0 + strftime('%m', o.OrderDate) BETWEEN 1 AND 3 THEN 'Q1'
                WHEN 0 + strftime('%m', o.OrderDate) BETWEEN 4 AND 6 THEN 'Q2'
                WHEN 0 + strftime('%m', o.OrderDate) BETWEEN 7 AND 9 THEN 'Q3'
                WHEN 0 + strftime('%m', o.OrderDate) BETWEEN 10 AND 12 THEN 'Q4'
            END AS quarter,
            CAST(strftime('%Y', o.OrderDate) AS INT) Year, c.CustomerID,
            ROUND(SUM(p.ProductUnitPrice * o.QuantityOrdered)) AS Total
        FROM OrderDetail o
        JOIN Customer c ON c.CustomerID = o.CustomerID
        JOIN Product p ON p.ProductID = o.ProductID
        GROUP BY c.CustomerID, Year, Quarter
        ORDER BY Year, Quarter, c.CustomerID
    

     """
df = pd.read_sql_query(sql_statement, conn)
display(df)
conn.close()

     quarter  Year  CustomerID     Total
0         Q3  2012           1  222850.0
1         Q3  2012           2  284898.0
2         Q3  2012           3  415084.0
3         Q3  2012           4  389739.0
4         Q3  2012           5  374268.0
...      ...   ...         ...       ...
1360      Q1  2016          87  494780.0
1361      Q1  2016          88   28483.0
1362      Q1  2016          89  281211.0
1363      Q1  2016          90  158755.0
1364      Q1  2016          91  160068.0

[1365 rows x 4 columns]

In [4]:
conn.close()